Revit 2027 API
TableSectionData.GetCellCalculatedValue(Int32, Int32) Method
 Gets the calculated value for the specified cell
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableCellCalculatedValueData GetCellCalculatedValue(
	int nRow,
	int nCol
)
Public Function GetCellCalculatedValue (
	nRow As Integer,
	nCol As Integer
) As TableCellCalculatedValueData
public:
TableCellCalculatedValueData^ GetCellCalculatedValue(
	int nRow,
	int nCol
)
member GetCellCalculatedValue :
        nRow : int *
        nCol : int -> TableCellCalculatedValueData
Parameters
nRow Int32
nCol Int32
Return Value
TableCellCalculatedValueData
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellCalculatedValue Overload
Autodesk.Revit.DB Namespace